<!DOCTYPE html>
<html>

<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-58280072-1', 'auto');
  ga('send', 'pageview');

</script>

<head>
	<title>PTR</title>
	<meta name="author" content="Rapha&euml;l Chartier" />
	<meta name="date" content="2014-12-31" />
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
	<link rel="stylesheet" href="../css/blog.css">
</head>
<body>
	<h1 class="title">Internet</h1>
	<a href="index.html"><img id= "logo" alt="logo" src="../images/logo.png"></a>
	<section>
<p style="text-align: left;" align="CENTER"><span style="color: #808000;"><span style="font-family: 'Anonymous Pro', monospace;"><span style="text-decoration: underline;">L'histoire d'internet :</span></span></span></p>
<p><span style="font-size: medium;">En 1961, Leonard Kleinrock du MIT publia le premier texte th&eacute;orique sur les t&eacute;l&eacute;communications par paquets (sockets en anglais) et en1964, il publia le premier livre sur le sujet. Ensuite, en 1965, Thomas Merrill et Roberts testent la premi&egrave;re connexion informatique &agrave; distance (Massachusetts - Californie) et ils d&eacute;montrent que des ordinateurs peuvent travailler ensemble et &agrave; distance. Ils emploient la communication par paquets car la transmission via les lignes t&eacute;l&eacute;phoniques &eacute;taient inadapt&eacute;es. Le nom internet vient de " inter-communication " et de " net-work ".</span></span></span></p>
<p><span style="font-size: medium;">ARPANET (" Advanced Research Projects Agency Network "), cr&eacute;&eacute;e par laDARPA (la DARPA est charg&eacute;e de la recherche et d&eacute;veloppement de nouvelles technologies pour un usage militaire), est le tout premier r&eacute;seau &agrave; transfert de paquets, se situant aux Etats-Unis, le but &eacute;tant de permettre la connexion entre ARPANET, des communications avec des satellites, par radio, par t&eacute;l&eacute;phones...</span></span></span></p>
<p><span style="font-size: medium;">Op&eacute;rationnel le 20 septembre 1969, ARPANET fait des essais en reliant plusieurs universit&eacute;s et centre de recherche avec des " noeuds " : ces  noeuds  transmettent l'information re&ccedil;u &agrave; l'autre borne, qui capte l'information. Un message f&ucirc;t envoy&eacute; le 29 octobre, qui, &agrave; cause d'un bug, l'envoie des 3 derni&egrave;res lettres mettront 1 heure &agrave; arriver &agrave; destination.</span></span></span></p>
<p><span style="font-size: medium;">Le premier protocole NCP d'ARPANET a plusieurs probl&egrave;mes, notamment l'inaptitude de se connecter &agrave; d'autres h&ocirc;tes qu'APRANET ni de corriger quelques erreurs de transmission. Un homme, nomm&eacute; Bob Kahn, eu l'id&eacute;e de d&eacute;velopper une nouvelle protocole : TCP/IP, toujours utilis&eacute; de nos jours (quelques d&eacute;rivations/am&eacute;liorations ont &eacute;taient cr&eacute;&eacute;es comme l'IPV4 et l'IPV6).</span></span></span></p>
<p><span style="font-size: medium;">A la fin des ann&eacute;es 1980, la National Science Foundation (NSF) met en place cinq centres informatiques aux &Eacute;tats-Unis, pour permettre aux utilisateurs se trouvant n'importe o&ugrave; aux &Eacute;tats-Unis de se connecter.</span></span></span></p>
<p><span style="font-size: medium;">Vers les ann&eacute;es 1990, le web est cr&eacute;e, un ensemble de pages en HTML(un langage de script qui permet de concevoir une page internet), avec du texte, des images, des liens. Accessible via une URL (Uniform Resource Locator) qui contient le protocole, le World Wide Web (www) et enfin l'adresse du site. L'URL permet de se connecter au serveur pour recevoir les diff&eacute;rentes donn&eacute;es de la page. Le protocole au d&eacute;but des ann&eacute;es 1990 est le HTTP (Hypertext Transfer Protocol) qui permet la communication non s&eacute;curis&eacute;e du client au serveur.</span></span></span></p>
<p align="LEFT"><span style="color: #800000;"><img alt="" src="http://www.wired.com/images_blogs/beyond_the_beyond/2010/03/yahoousa_home-page_1995.jpg" /></span></p>
<p align="CENTER"><span style="color: #000000;"><span style="font-family: 'Anonymous Pro', monospace;">Internet en 1995 avec le moteur de recherche " Yahoo! "</span></span></p>
<p><span style="font-size: medium;">Le plus c&eacute;l&egrave;bre des moteurs de recherche, Google, a &eacute;tait cr&eacute;e le 4 septembre 1998 par Segue&iuml; Brin et Larry Page. Google, &agrave; ses d&eacute;buts, ne pouvait pas trouver plus de 25, 50 ou 100 sites web en une seule recherche, tandis que maintenant, il peut en afficher plus de 2 millions en moins d'une seconde. Mais il a quand m&ecirc;me r&eacute;ussi &agrave; cr&eacute;er un tournant majeur pour l'internet. En effet, il r&eacute;pondait &agrave; plus de 10 000 requ&ecirc;tes par jour. Sa facilit&eacute;, son ergonomie et sa rapidit&eacute; fait vite parler de lui, et chaque jours, internet devient de plus en plus connu. Mais ce n'est pas le seul moteur de recherche actif, il y a aussi " Yahoo! " cr&eacute;&eacute; le 1er mars 1995.</span></span></span></p>
<p align="LEFT"><span style="color: #000000;"><img alt="" src="http://blogoscoped.com/files/google-com-history/thumb/1998.jpg" width="502" height="304" name="images2" align="BOTTOM" border="0" /> </span></p>
<p align="CENTER"><span style="color: #000000;"><span style="font-family: 'Anonymous Pro', monospace;">2&egrave;me version de Google, en phase BETA. En 1998</span></span></p>
<p align="LEFT"><span style="color: #008000;"><span style="font-family: 'Anonymous Pro', monospace;"><span style="text-decoration: underline;">2 - Pourquoi la cr&eacute;ation d'internet</span></span></span></p>
<p><span style="font-size: medium;">Internet a &eacute;tait cr&eacute;e pour r&eacute;pondre &agrave; des besoins &eacute;conomiques, culturelles et sociables. Au d&eacute;but, internet &eacute;tait utilis&eacute; pour l'arm&eacute;e Am&eacute;ricaine, pour pouvoir pr&eacute;venir rapidement d'&eacute;ventuelles probl&egrave;mes ou attaques. </span></span></span></p>
<p><span style="font-size: medium;">Maintenant, on l'utilise principalement pour l'information et le divertissement.</span></span></span></p>
<p align="LEFT"><span style="color: #008000;"><span style="font-family: 'Anonymous Pro', monospace;"><span style="text-decoration: underline;">3 - Quelques protocoles</span></span></span></p>
<p><span style="font-size: medium;">Les protocoles sont essentiels dans le bon fonctionnement d'internet. Ils permettent de structurer des &eacute;changes d'informations n&eacute;cessaires au transfert des contenus. Ils permettent de s'assurer de la r&eacute;ception des donn&eacute;es envoy&eacute;es &agrave; l'utilisateur par l'interm&eacute;diaire d'un serveur.</span></span></span></p>
<p><span style="font-size: medium;">Internet, pour fonctionner et facilit&eacute; la t&acirc;che, doit fonctionner par " couches ", chaque couche a une fonctionnalit&eacute; tr&egrave;s pr&eacute;cise. Il existe une couche principale, 3 secondaires et 9 tertiaires.</span></span></span></p>
<p><span style="font-size: medium;">Voici un arbre des diff&eacute;rents protocoles :</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">IP (Internet Protocol), protocole permettant de d&eacute;finir le mode d'&eacute;change entre ordinateurs en leur donnant une adresse unique sur l'ordinateur. L'Ipv4 (une suite de chiffre) &eacute;tait une cl&eacute; unique pour chaque ordinateur, mais en raison du trop grand nombre d'utilisateur (plus de 2,5 milliards en 2012), une nouvelle sorte de clef sort : l'Ipv6 (une suite de chiffres et de lettres)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">TCP</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">HTTP (HyperText Transfer Protocol)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Principale protocole pour le chargement des pages webs, mais non s&eacute;curis&eacute; </span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">HTTPS</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Autre version du HTTP, mais cette fois ci s&eacute;curis&eacute;</span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">FTP (File Transfer Protocol)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Protocole utilis&eacute; pour envoyer n'importe quelle sorte de fichiers sur internet</span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">SMTP (Simple Mail Transfer Protocol)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Protocole servant &agrave; envoyer un e-mail (courriel &eacute;lectronique) </span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">IRC (Internet Relay Chat)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Protocole permettant de discuter instantan&eacute;ment avec d'autres personnes </span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">NNTP (Network News Transfer Protocol)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Protocole permettant le transfert de message utilis&eacute; par des forums de discussions Usenet </span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">IMAP (Internet Message Access Pro</span></span></span></p>
</li>
	<li>
<p><span style="font-size: medium;">tocol)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Une m&eacute;thode diff&eacute;rente d'envois d'e-mail</span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">POP3 (Post Office Protocol V3)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Protocole permettant de recevoir du courriel</span></span></span></p>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">TSL (Transport Layer Security)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Protocole utilis&eacute; pour avoir une transaction s&eacute;curis&eacute;e, tr&egrave;s souvent utilis&eacute; pour les payements s&eacute;curis&eacute;s</span></span></span></p>
</li>
</ul>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">UDP (User Datagram Protocol) permet une communication non fiable mais l&eacute;g&egrave;re et donc rapide en utilisant des " Datagrammes "</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">DNS (Domain Name System)</span></span></span></p>

<ul>
	<li>
<p><span style="font-size: medium;">Protocole de r&eacute;solution de noms Internet</span></span></span></p>
</li>
</ul>
</li>
</ul>
</li>
	<li>
<p><span style="font-size: medium;">ICMP (Internet Control Message Protocol) protocole de contr&ocirc;le de l'IP</span></span></span></p>
</li>
</ul>
</li>
</ul>	
	<footer>
		<a href="../index.html">Index</p>
	</footer>
	</section>
</body>
</head>